services.org
#+TITLE: Services Loom: DotCortex
#+DESCRIPTION: Systemd services
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Services Loom
This loom tracks small service wrappers and helper scripts that live in
the =.local/bin= overlays and are deployed via stow.

* Early OOM
Scripts to apply a conservative, balanced OOM policy.
The X230 runs systemd; the T480s runs Devuan/sysvinit.
Both expose the same =MODE= knob (=balanced= | =proactive=).

** earlyoom-balanced — X230 (systemd drop-in)
Writes a systemd drop-in at =/etc/systemd/system/earlyoom.service.d/override.conf=
and restarts the service.  Avoids =/etc/default/= quoting issues by setting
=ExecStart= directly.

#+BEGIN_SRC bash :tangle x230/.local/bin/earlyoom-balanced :shebang "#!/usr/bin/env bash"
set -euo pipefail

MODE="${MODE:-balanced}"   # balanced or proactive

# Kill this stuff first if we MUST kill something:
#  - non-critical XFCE daemons
#  - media / background apps
#  - tools that autosave (Obsidian, Telegram)
PREFER='^(xfce4-screensaver|xfce4-clipman|xfdesktop|xfce4-notifyd|kdeconnectd|fluidsynth|jellyfin|[Oo]bsidian|Telegram|WebExtensions|qmmp)$'

# Protect these at all costs:
#  - browsers (no autosave guarantees)
#  - Codium / Code (no autosave guarantees in your current setup)
#  - file managers + GVFS plumbing
#  - file transfer / backup tools (rsync, etc.)
#  - xfce4-session so we don't drop the whole session
AVOID='^(firedragon|floorp|zen|ungoogled-chromium|firefox|codium|code|thunar|gvfs.*|rsync|scp|sftp|rclone|syncthing|borg|restic|xfce4-session|barrier|barriers|signal-desktop|Betterbird|betterbird|thunderbird)$'

if [[ "$MODE" = "balanced" ]]; then
  M_TERM=5;  M_KILL=3;  S_TERM=15; S_KILL=10
elif [[ "$MODE" = "proactive" ]]; then
  M_TERM=7;  M_KILL=5;  S_TERM=20; S_KILL=10
else
  echo "Unknown MODE='$MODE' (use balanced or proactive)" >&2
  exit 1
fi

DROPIN_DIR="/etc/systemd/system/earlyoom.service.d"
DROPIN="${DROPIN_DIR}/override.conf"

sudo install -d -m 0755 "$DROPIN_DIR"

# Write drop-in atomically
TMP="$(mktemp)"
cat >"$TMP" <<EOF
[Service]
EnvironmentFile=
ExecStart=
ExecStart=/usr/bin/earlyoom -r 3600 -m ${M_TERM},${M_KILL} -s ${S_TERM},${S_KILL} \
  --prefer ${PREFER} \
  --avoid  ${AVOID}
OOMScoreAdjust=-100
Nice=-20
EOF
sudo install -m 0644 "$TMP" "$DROPIN"
rm -f "$TMP"

sudo systemctl daemon-reload
sudo systemctl restart earlyoom

echo "Applied Early OOM policy: mem ${M_TERM}%/${M_KILL}%, swap ${S_TERM}%/${S_KILL}%"
echo "Prefer: ${PREFER}"
echo "Avoid:  ${AVOID}"

# Show the running command and thresholds
if pidof earlyoom >/dev/null; then
  tr '\0' ' ' </proc/$(pidof earlyoom)/cmdline; echo
  journalctl -u earlyoom -b --no-pager | tail -n 20
else
  echo "earlyoom is not running" >&2
  exit 2
fi
#+END_SRC

** earlyoom-balanced — T480s (Devuan / sysvinit)
Writes =/etc/default/earlyoom= (the sysvinit-native config file) and restarts
via =service earlyoom restart=.  Logs are checked via syslog since there is no
journald on Devuan.

#+BEGIN_SRC bash :tangle t480s/.local/bin/earlyoom-balanced :shebang "#!/usr/bin/env bash"
set -euo pipefail

MODE="${MODE:-balanced}"   # balanced or proactive

# Kill this stuff first if we MUST kill something:
#  - non-critical XFCE daemons
#  - media / background apps
#  - tools that autosave (Obsidian, Telegram)
PREFER='^(xfce4-screensaver|xfce4-clipman|xfdesktop|xfce4-notifyd|kdeconnectd|fluidsynth|jellyfin|[Oo]bsidian|Telegram|WebExtensions|qmmp)$'

# Protect these at all costs:
#  - browsers (no autosave guarantees)
#  - Codium / Code (no autosave guarantees in your current setup)
#  - file managers + GVFS plumbing
#  - file transfer / backup tools (rsync, etc.)
#  - xfce4-session so we don't drop the whole session
AVOID='^(firedragon|floorp|zen|ungoogled-chromium|firefox|codium|code|thunar|gvfs.*|rsync|scp|sftp|rclone|syncthing|borg|restic|xfce4-session|barrier|barriers|signal-desktop|Betterbird|betterbird|thunderbird)$'

if [[ "$MODE" = "balanced" ]]; then
  M_TERM=5;  M_KILL=3;  S_TERM=15; S_KILL=10
elif [[ "$MODE" = "proactive" ]]; then
  M_TERM=7;  M_KILL=5;  S_TERM=20; S_KILL=10
else
  echo "Unknown MODE='$MODE' (use balanced or proactive)" >&2
  exit 1
fi

# Devuan: earlyoom is configured via /etc/default/earlyoom (EARLYOOM_ARGS)
DEFAULT_FILE="/etc/default/earlyoom"
TMP="$(mktemp)"
cat >"$TMP" <<EOF
# Managed by earlyoom-balanced — do not edit by hand.
EARLYOOM_ARGS="-r 3600 -m ${M_TERM},${M_KILL} -s ${S_TERM},${S_KILL} --prefer ${PREFER} --avoid ${AVOID}"
EOF
sudo install -m 0644 "$TMP" "$DEFAULT_FILE"
rm -f "$TMP"

sudo service earlyoom restart

echo "Applied Early OOM policy: mem ${M_TERM}%/${M_KILL}%, swap ${S_TERM}%/${S_KILL}%"
echo "Prefer: ${PREFER}"
echo "Avoid:  ${AVOID}"

# Show the running command and check it is up
if pidof earlyoom >/dev/null; then
  tr '\0' ' ' </proc/$(pidof earlyoom)/cmdline; echo
  grep earlyoom /var/log/syslog 2>/dev/null | tail -n 20 || true
else
  echo "earlyoom is not running" >&2
  exit 2
fi
#+END_SRC

** Jellyfin toggle (ThinkPad X230 server)
This script lives in the =x230= overlay, it is specific to the current
X230 that is running Jellyfin as a systemd service.
#+BEGIN_SRC bash :tangle x230/.local/bin/jellyfin-toggle :shebang "#!/bin/sh"
# jellyfin-toggle
# Toggle Jellyfin Media Server on and off via systemd.
# Requires sudoers entry:
#   metsatron ALL=(root) NOPASSWD: /usr/bin/systemctl

if systemctl is-active --quiet jellyfin; then
  exec sudo -n /usr/bin/systemctl stop jellyfin
else
  exec sudo -n /usr/bin/systemctl start jellyfin
fi
#+END_SRC

After first tangle:

#+BEGIN_SRC bash
chmod +x ~/DotCortex/x230/.local/bin/jellyfin-toggle
#+END_SRC

Panel launcher command:
#+BEGIN_SRC bash
sh -c 'if systemctl is-active --quiet jellyfin; then sudo -n /usr/bin/systemctl stop jellyfin; else sudo -n /usr/bin/systemctl start jellyfin; fi'
#+END_SRC

*** Jellyfin sudoers drop in (manual step)
This is not tangled, since =/etc/sudoers.d= is root territory. The doc
lives here so the setup is reproducible.

Install or re install with:
#+BEGIN_SRC bash
sudo visudo -f /etc/sudoers.d/jellyfin-toggle
#+END_SRC

Then type this line by hand inside =visudo=:
#+BEGIN_SRC sudoers
metsatron ALL=(root) NOPASSWD: /usr/bin/systemctl
#+END_SRC

Test:
#+BEGIN_SRC bash
sudo -n /usr/bin/systemctl status jellyfin
sudo -n /usr/bin/systemctl stop jellyfin
sudo -n /usr/bin/systemctl start jellyfin
#+END_SRC

If there is no password prompt, the panel toggle is good.

** hermes-gateway — T480s (Devuan / sysvinit)
The Hermes Gateway is a user-level process. We manage it via a wrapper script and @reboot cron.

#+BEGIN_SRC bash :tangle t480s/.local/bin/hermes-gateway :shebang "#!/usr/bin/env bash"
set -euo pipefail

PID_FILE="$HOME/.hermes/gateway.pid"
LOG_FILE="$HOME/.hermes/gateway.log"
CMD="$HOME/.local/bin/hermes gateway run"

# Helper to extract PID from JSON PID file
get_pid() {
 local pid_file="$1"
 if command -v jq >/dev/null 2>&1; then
 jq -r .pid "$pid_file" 2>/dev/null || cat "$pid_file"
 else
 # Fallback: grep for "\"pid\":" in JSON
 grep -o '"pid":[0-9]*' "$pid_file" 2>/dev/null | cut -d: -f2 || cat "$pid_file"
 fi
}

start_gateway() {
 if [ -f "$PID_FILE" ] && kill -0 $(get_pid "$PID_FILE") 2>/dev/null; then
 echo "Gateway is already running (PID $(get_pid "$PID_FILE"))"
 return 0
 fi
 echo "Starting Hermes Gateway..."
 nohup $CMD >"$LOG_FILE" 2>&1 &
 echo $! >"$PID_FILE"
 echo "Gateway started with PID $!"
}

stop_gateway() {
 if [ -f "$PID_FILE" ]; then
 PID=$(get_pid "$PID_FILE")
 echo "Stopping Gateway (PID $PID)..."
 kill $PID || true
 rm -f "$PID_FILE"
 echo "Gateway stopped."
 else
 echo "Gateway is not running."
 fi
}

case "${1:-}" in
  start)    start_gateway ;;
  stop)     stop_gateway ;;
  restart)  stop_gateway; start_gateway ;;
 status) 
 if [ -f "$PID_FILE" ] && kill -0 $(get_pid "$PID_FILE") 2>/dev/null; then
 echo "Gateway is running (PID $(get_pid "$PID_FILE"))"
 else
 echo "Gateway is stopped."
 fi
 ;;
 *)
 echo "Usage: ${0##*/} {start|stop|restart|status}"
 exit 1
 ;;
esac
#+END_SRC

* Swap tools
