t480s/.local/bin/earlyoom-balanced
#!/usr/bin/env bash
# earlyoom-balanced — T480s (Devuan / sysvinit)
# Writes =/etc/default/earlyoom= (the sysvinit-native config file) and restarts
# via =service earlyoom restart=.  Logs are checked via syslog since there is no
# journald on Devuan.


# [[file:../../../services.org::*earlyoom-balanced — T480s (Devuan / sysvinit)][earlyoom-balanced — T480s (Devuan / sysvinit):1]]
set -euo pipefail

MODE="${MODE:-balanced}"   # balanced or proactive

# Kill this stuff first if we MUST kill something:
#  - non-critical XFCE daemons
#  - media / background apps
#  - tools that autosave (Obsidian, Telegram)
PREFER='^(xfce4-screensaver|xfce4-clipman|xfdesktop|xfce4-notifyd|kdeconnectd|fluidsynth|jellyfin|[Oo]bsidian|Telegram|WebExtensions|qmmp)$'

# Protect these at all costs:
#  - browsers (no autosave guarantees)
#  - Codium / Code (no autosave guarantees in your current setup)
#  - file managers + GVFS plumbing
#  - file transfer / backup tools (rsync, etc.)
#  - xfce4-session so we don't drop the whole session
AVOID='^(firedragon|floorp|zen|ungoogled-chromium|firefox|codium|code|thunar|gvfs.*|rsync|scp|sftp|rclone|syncthing|borg|restic|xfce4-session|barrier|barriers|signal-desktop|Betterbird|betterbird|thunderbird)$'

if [[ "$MODE" = "balanced" ]]; then
  M_TERM=5;  M_KILL=3;  S_TERM=15; S_KILL=10
elif [[ "$MODE" = "proactive" ]]; then
  M_TERM=7;  M_KILL=5;  S_TERM=20; S_KILL=10
else
  echo "Unknown MODE='$MODE' (use balanced or proactive)" >&2
  exit 1
fi

# Devuan: earlyoom is configured via /etc/default/earlyoom (EARLYOOM_ARGS)
DEFAULT_FILE="/etc/default/earlyoom"
TMP="$(mktemp)"
cat >"$TMP" <<EOF
# Managed by earlyoom-balanced — do not edit by hand.
EARLYOOM_ARGS="-r 3600 -m ${M_TERM},${M_KILL} -s ${S_TERM},${S_KILL} --prefer ${PREFER} --avoid ${AVOID}"
EOF
sudo install -m 0644 "$TMP" "$DEFAULT_FILE"
rm -f "$TMP"

sudo service earlyoom restart

echo "Applied Early OOM policy: mem ${M_TERM}%/${M_KILL}%, swap ${S_TERM}%/${S_KILL}%"
echo "Prefer: ${PREFER}"
echo "Avoid:  ${AVOID}"

# Show the running command and check it is up
if pidof earlyoom >/dev/null; then
  tr '\0' ' ' </proc/$(pidof earlyoom)/cmdline; echo
  grep earlyoom /var/log/syslog 2>/dev/null | tail -n 20 || true
else
  echo "earlyoom is not running" >&2
  exit 2
fi
# earlyoom-balanced — T480s (Devuan / sysvinit):1 ends here
