t480s/.local/bin/hermes-gateway
#!/usr/bin/env bash
# hermes-gateway — T480s (Devuan / sysvinit)
# The Hermes Gateway is a user-level process. We manage it via a wrapper script and @reboot cron.


# [[file:../../../services.org::*hermes-gateway — T480s (Devuan / sysvinit)][hermes-gateway — T480s (Devuan / sysvinit):1]]
set -euo pipefail

PID_FILE="$HOME/.hermes/gateway.pid"
LOG_FILE="$HOME/.hermes/gateway.log"
CMD="$HOME/.local/bin/hermes gateway run"

# Helper to extract PID from JSON PID file
get_pid() {
 local pid_file="$1"
 if command -v jq >/dev/null 2>&1; then
 jq -r .pid "$pid_file" 2>/dev/null || cat "$pid_file"
 else
 # Fallback: grep for "\"pid\":" in JSON
 grep -o '"pid":[0-9]*' "$pid_file" 2>/dev/null | cut -d: -f2 || cat "$pid_file"
 fi
}

start_gateway() {
 if [ -f "$PID_FILE" ] && kill -0 $(get_pid "$PID_FILE") 2>/dev/null; then
 echo "Gateway is already running (PID $(get_pid "$PID_FILE"))"
 return 0
 fi
 echo "Starting Hermes Gateway..."
 nohup $CMD >"$LOG_FILE" 2>&1 &
 echo $! >"$PID_FILE"
 echo "Gateway started with PID $!"
}

stop_gateway() {
 if [ -f "$PID_FILE" ]; then
 PID=$(get_pid "$PID_FILE")
 echo "Stopping Gateway (PID $PID)..."
 kill $PID || true
 rm -f "$PID_FILE"
 echo "Gateway stopped."
 else
 echo "Gateway is not running."
 fi
}

case "${1:-}" in
  start)    start_gateway ;;
  stop)     stop_gateway ;;
  restart)  stop_gateway; start_gateway ;;
 status) 
 if [ -f "$PID_FILE" ] && kill -0 $(get_pid "$PID_FILE") 2>/dev/null; then
 echo "Gateway is running (PID $(get_pid "$PID_FILE"))"
 else
 echo "Gateway is stopped."
 fi
 ;;
 *)
 echo "Usage: ${0##*/} {start|stop|restart|status}"
 exit 1
 ;;
esac
# hermes-gateway — T480s (Devuan / sysvinit):1 ends here
