x230/.local/bin/jellyfin-toggle
#!/bin/sh
# Jellyfin toggle (ThinkPad X230 server)
# This script lives in the =x230= overlay, it is specific to the current
# X230 that is running Jellyfin as a systemd service.

# [[file:../../../services.org::*Jellyfin toggle (ThinkPad X230 server)][Jellyfin toggle (ThinkPad X230 server):1]]
# jellyfin-toggle
# Toggle Jellyfin Media Server on and off via systemd.
# Requires sudoers entry:
#   metsatron ALL=(root) NOPASSWD: /usr/bin/systemctl

if systemctl is-active --quiet jellyfin; then
  exec sudo -n /usr/bin/systemctl stop jellyfin
else
  exec sudo -n /usr/bin/systemctl start jellyfin
fi
# Jellyfin toggle (ThinkPad X230 server):1 ends here
