services.org
** swaptop – top by VmSwap (btop-ish)
#+BEGIN_SRC bash :tangle linux/.local/bin/swaptop :shebang "#!/usr/bin/env bash"
set -euo pipefail

interval="${1:-5}"

# === Colors – keep in sync with swapfetch ===

# Nerd Font style: same palette as swapfetch
C_HDR=$'\e[1;36m'     # cyan bold (headers)
C_LABEL=$'\e[1;33m'   # yellow bold (labels)
C_VAL=$'\e[1;37m'     # white bold  (values)
C_DIM=$'\e[2;37m'     # dim white   (background / secondary)
C_OK=$'\e[1;32m'      # green
C_WARM=$'\e[1;33m'    # yellow
C_HOT=$'\e[1;31m'     # red
C_RESET=$'\e[0m'
C_BOLD=$'\033[1m'

# Bar background: “12th” color – aligned with swapfetch’s style
C_BAR_BG=$'\e[38;5;11m'

# Logo/header color
: "${C_LOGO:=$C_HDR}"

gauge_color_for() {
  local pct=$1
  if   (( pct >= 90 )); then printf '%s' "$C_HOT"
  elif (( pct >= 70 )); then printf '%s' "$C_WARM"
  else                       printf '%s' "$C_OK"
  fi
}

gauge_bar() {
  local pct=$1
  local width=${2:-24}
  local col="${3:-$C_OK}"      # filled color
  local bg="${4:-$C_BAR_BG}"   # unfilled “background”

  ((pct < 0))   && pct=0
  ((pct > 100)) && pct=100

  local filled=$(( (pct * width + 50) / 100 ))
  ((filled > width)) && filled=$width

  local filled_str="" empty_str=""
  local i
  for ((i=1; i<=filled; i++)); do
    filled_str+="█"
  done
  for ((; i<=width; i++)); do
    empty_str+="█"
  done

  printf '%b' "${col}${filled_str}${bg}${empty_str}${C_RESET}"
}

# Use tput if available so we can move the cursor without nuking scrollback
HAS_TPUT=0
if command -v tput >/dev/null 2>&1; then
  HAS_TPUT=1
  tput civis 2>/dev/null || true
  trap 'tput cnorm 2>/dev/null || true; exit' INT TERM
fi

# How many process rows we printed last time
LAST_ROWS=0

print_row() {
  local idx="$1"
  local line pid kb pct col bar mib cmdline

  line=${_rows[idx]}
  set -- $line
  pid=$1
  kb=$2

  [[ -z "$pid" || -z "$kb" ]] && return 0

  # percent of total swap
  pct=$(( (kb * 100 + local_total_swap_kb/2) / local_total_swap_kb ))
  ((pct < 0))   && pct=0
  ((pct > 100)) && pct=100

  col="$(gauge_color_for "$pct")"
  bar="$(gauge_bar "$pct" 24 "$col" "$C_BAR_BG")"

  # human readable MiB
  mib=$(awk -v k="$kb" 'BEGIN {printf "%.1f", k/1024}')

  # command line (shortened single-line)
  cmdline=$(ps -p "$pid" -o comm=,args= 2>/dev/null || true)
  cmdline=${cmdline# }
  cmdline=${cmdline//$'\n'/ }
  cmdline=${cmdline:0:60}

  printf "%7s %7s MiB %3d%% %s %s\n" \
    "$pid" "$mib" "$pct" "$bar" "$cmdline"
}

while :; do
  # Terminal height (only if tput exists)
  if (( HAS_TPUT )); then
    term_lines=$(tput lines 2>/dev/null || echo 24)
  else
    term_lines=24
  fi

  # Total swap in KiB
  local_total_swap_kb=$(awk '/^SwapTotal:/ {print $2}' /proc/meminfo)
  (( local_total_swap_kb == 0 )) && local_total_swap_kb=1

  # Collect processes sorted by VmSwap DESC
  mapfile -t _rows < <(
    awk '/^VmSwap:/ {print FILENAME, $2}' /proc/[0-9]*/status 2>/dev/null \
      | sed 's#/proc/\([0-9]*\)/status#\1#' \
      | sort -k2,2nr
  )

  rows_len=${#_rows[@]}
  if (( rows_len == 0 )); then
    current_rows=0
  else
    # 1 title + 1 header + 1 separator + 1 breathing line = 4
    max_rows=$((term_lines - 4))
    ((max_rows < 1)) && max_rows=1
    current_rows=$rows_len
    ((current_rows > max_rows)) && current_rows=$max_rows
  fi

  if (( HAS_TPUT )); then
    # --- Header lines (each one: move, clear line, print) ---

    tput cup 0 0 2>/dev/null
    printf '\033[K'
    printf '%b%s%b  (interval %ss)\n' \
      "$C_HDR" "swaptop – top VmSwap users" "$C_RESET" "$interval"

    tput cup 1 0 2>/dev/null
    printf '\033[K'
    printf '%b%-7s %-8s %-8s %-5s %-s%b\n' \
      "$C_LABEL" "PID" "SWAP" "PCT" "BAR" "COMMAND" "$C_RESET"

    tput cup 2 0 2>/dev/null
    printf '\033[K'
    printf '%s\n' "--------------------------------------------------------------------------"

    if (( current_rows == 0 )); then
      # No rows: print a single status line
      tput cup 3 0 2>/dev/null
      printf '\033[K'
      printf "   (no processes with VmSwap)\n"
    else
      # Print each row at a fixed line, clearing only that line
      for ((idx=0; idx<current_rows; idx++)); do
        line_no=$((3 + idx))
        tput cup "$line_no" 0 2>/dev/null
        printf '\033[K'
        print_row "$idx"
      done
    fi

    # If we had more rows last time, blank the leftovers
    if (( LAST_ROWS > current_rows )); then
      for ((idx=current_rows; idx<LAST_ROWS; idx++)); do
        line_no=$((3 + idx))
        tput cup "$line_no" 0 2>/dev/null
        printf '\033[K'
      done
    fi

  else
    # Fallback: dumb terminal – just print a fresh block each tick
    printf '%b%s%b  (interval %ss)\n' \
      "$C_HDR" "swaptop – top VmSwap users" "$C_RESET" "$interval"
    printf '%b%-7s %-8s %-8s %-5s %-s%b\n' \
      "$C_LABEL" "PID" "SWAP" "PCT" "BAR" "COMMAND" "$C_RESET"
    printf '%s\n' "--------------------------------------------------------------------------"

    if (( current_rows == 0 )); then
      printf "   (no processes with VmSwap)\n"
    else
      for ((idx=0; idx<current_rows; idx++)); do
        print_row "$idx"
      done
    fi
  fi

  LAST_ROWS=$current_rows
  sleep "$interval"
done
#+END_SRC

** xfce4-refresh – recycle XFCE desktop daemons via host-wrap
#+BEGIN_SRC bash :tangle x230/.local/bin/xfce4-refresh :shebang "#!/usr/bin/env bash"
set -euo pipefail

log() {
  printf '[xfce4-refresh] %s\n' "$*"
}

kill_if_running() {
  local name="$1"
  if pgrep -x "$name" >/dev/null 2>&1; then
    log "Killing $name…"
    pkill -x "$name" || true
  fi
}

start_with_host_wrap_if_missing() {
  local name="$1"
  if ! pgrep -x "$name" >/dev/null 2>&1; then
    if command -v host-wrap >/dev/null 2>&1; then
      log "Starting $name via host-wrap…"
      nohup host-wrap "$name" >/dev/null 2>&1 &
    else
      log "host-wrap not found; starting $name directly…"
      nohup "$name" >/dev/null 2>&1 &
    fi
  fi
}

log "Refreshing XFCE desktop daemons"

# 1) Kill screensaver and leave it dead - handle truncated comm name
if pgrep -x xfce4-screensav >/dev/null 2>&1 || pgrep -f /usr/bin/xfce4-screensaver >/dev/null 2>&1; then
  log "Killing xfce4-screensaver..."
  pkill -x xfce4-screensav || pkill -f /usr/bin/xfce4-screensaver || true
fi

# 2) Clipman: kill + restart (via host-wrap)
kill_if_running xfce4-clipman
start_with_host_wrap_if_missing xfce4-clipman

# 3) Desktop: kill + restart (via host-wrap)
kill_if_running xfdesktop
start_with_host_wrap_if_missing xfdesktop

# 4) Notifications: kill + restart (via host-wrap)
if command -v xfce4-notifyd >/dev/null 2>&1; then
  kill_if_running xfce4-notifyd
  start_with_host_wrap_if_missing xfce4-notifyd
fi

# 5) xfrun4 - kill if it is hanging around - do not restart
kill_if_running xfrun4

# 6) Panel + settings: delegate to canonical healer
if command -v xfce4-heal >/dev/null 2>&1; then
  log "Delegating panel + settings restart to xfce4-heal…"
  xfce4-heal
elif command -v xfce4-panel >/dev/null 2>&1; then
  # Fallback path if xfce4-heal is missing for some reason
  if pgrep -x xfce4-panel >/dev/null 2>&1; then
    log "xfce4-heal missing; trying xfce4-panel -r fallback…"
    if ! xfce4-panel -r >/dev/null 2>&1; then
      log "xfce4-panel -r failed, trying kill + restart via host-wrap/direct…"
      kill_if_running xfce4-panel
      start_with_host_wrap_if_missing xfce4-panel
    fi
  else
    log "xfce4-heal missing; xfce4-panel not running, starting fresh via host-wrap…"
    start_with_host_wrap_if_missing xfce4-panel
  fi
fi

log "Done."
#+END_SRC

