x230/.local/bin/xfce4-refresh
#!/usr/bin/env bash
# xfce4-refresh – recycle XFCE desktop daemons via host-wrap

# [[file:../../../services.org::*xfce4-refresh – recycle XFCE desktop daemons via host-wrap][xfce4-refresh – recycle XFCE desktop daemons via host-wrap:1]]
set -euo pipefail

log() {
  printf '[xfce4-refresh] %s\n' "$*"
}

kill_if_running() {
  local name="$1"
  if pgrep -x "$name" >/dev/null 2>&1; then
    log "Killing $name…"
    pkill -x "$name" || true
  fi
}

start_with_host_wrap_if_missing() {
  local name="$1"
  if ! pgrep -x "$name" >/dev/null 2>&1; then
    if command -v host-wrap >/dev/null 2>&1; then
      log "Starting $name via host-wrap…"
      nohup host-wrap "$name" >/dev/null 2>&1 &
    else
      log "host-wrap not found; starting $name directly…"
      nohup "$name" >/dev/null 2>&1 &
    fi
  fi
}

log "Refreshing XFCE desktop daemons"

# 1) Kill screensaver and leave it dead - handle truncated comm name
if pgrep -x xfce4-screensav >/dev/null 2>&1 || pgrep -f /usr/bin/xfce4-screensaver >/dev/null 2>&1; then
  log "Killing xfce4-screensaver..."
  pkill -x xfce4-screensav || pkill -f /usr/bin/xfce4-screensaver || true
fi

# 2) Clipman: kill + restart (via host-wrap)
kill_if_running xfce4-clipman
start_with_host_wrap_if_missing xfce4-clipman

# 3) Desktop: kill + restart (via host-wrap)
kill_if_running xfdesktop
start_with_host_wrap_if_missing xfdesktop

# 4) Notifications: kill + restart (via host-wrap)
if command -v xfce4-notifyd >/dev/null 2>&1; then
  kill_if_running xfce4-notifyd
  start_with_host_wrap_if_missing xfce4-notifyd
fi

# 5) xfrun4 - kill if it is hanging around - do not restart
kill_if_running xfrun4

# 6) Panel + settings: delegate to canonical healer
if command -v xfce4-heal >/dev/null 2>&1; then
  log "Delegating panel + settings restart to xfce4-heal…"
  xfce4-heal
elif command -v xfce4-panel >/dev/null 2>&1; then
  # Fallback path if xfce4-heal is missing for some reason
  if pgrep -x xfce4-panel >/dev/null 2>&1; then
    log "xfce4-heal missing; trying xfce4-panel -r fallback…"
    if ! xfce4-panel -r >/dev/null 2>&1; then
      log "xfce4-panel -r failed, trying kill + restart via host-wrap/direct…"
      kill_if_running xfce4-panel
      start_with_host_wrap_if_missing xfce4-panel
    fi
  else
    log "xfce4-heal missing; xfce4-panel not running, starting fresh via host-wrap…"
    start_with_host_wrap_if_missing xfce4-panel
  fi
fi

log "Done."
# xfce4-refresh – recycle XFCE desktop daemons via host-wrap:1 ends here
