services.org
** xfce4-refresh-guardian – early panel refresh on high swap + panel revive
#+BEGIN_SRC bash :tangle x230/.local/bin/xfce4-refresh-guardian :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
# xfce4-refresh-guardian – early refresh trigger based on swap
# and “is the panel actually visible?”

set -euo pipefail

SWAP_LIMIT="${SWAP_LIMIT:-80}"

DO_RESTART=0
if [[ "${1:-}" == "--restart" || "${1:-}" == "-r" ]]; then
  DO_RESTART=1
fi

# --- helper: is the xfce4-panel actually alive (proc + window)? ---
panel_is_alive=0

if pgrep -x xfce4-panel >/dev/null 2>&1; then
  # We have a process – now check for a real panel window if wmctrl exists.
  if command -v wmctrl >/dev/null 2>&1; then
    if wmctrl -lx 2>/dev/null | grep -qi "xfce4-panel.Xfce4-panel"; then
      panel_is_alive=1
    else
      printf '[xfce4-refresh-guardian] xfce4-panel process found, but no panel window.\n'
    fi
  else
    # No wmctrl? fall back to trusting the process
    panel_is_alive=1
  fi
else
  printf '[xfce4-refresh-guardian] No xfce4-panel process.\n'
fi

# If the panel is missing (no process OR no window), healing is top priority.
if (( panel_is_alive == 0 )); then
  printf '[xfce4-refresh-guardian] xfce4-panel is NOT alive, attempting heal via xfce4-heal…\n'
  if command -v xfce4-heal >/dev/null 2>&1; then
    xfce4-heal
    # Give it a moment, then re-check both process + window.
    sleep 1

    panel_is_alive_after=0
    if pgrep -x xfce4-panel >/dev/null 2>&1; then
      if command -v wmctrl >/dev/null 2>&1; then
        if wmctrl -lx 2>/dev/null | grep -qi "xfce4-panel.Xfce4-panel"; then
          panel_is_alive_after=1
        fi
      else
        panel_is_alive_after=1
      fi
    fi

    if (( panel_is_alive_after == 1 )); then
      printf '[xfce4-refresh-guardian] Panel is now running (process + window detected).\n'
    else
      printf '[xfce4-refresh-guardian] Heal attempted, but panel still not detected.\n'
    fi
  else
    printf '[xfce4-refresh-guardian] xfce4-heal not found; cannot restore panel.\n'
  fi

  # Panel health is a higher priority than swap tuning – stop here.
  exit 0
fi

# --- at this point: panel_is_alive == 1, proceed with swap threshold logic ---

# Read swap from /proc/meminfo (KiB)
swap_total_kb=$(awk '/^SwapTotal:/ {print $2}' /proc/meminfo)
swap_free_kb=$(awk '/^SwapFree:/  {print $2}' /proc/meminfo)

if (( swap_total_kb == 0 )); then
  SWAP_PCT=0
else
  swap_used_kb=$((swap_total_kb - swap_free_kb))
  SWAP_PCT=$(( (swap_used_kb * 100 + swap_total_kb/2) / swap_total_kb ))
fi

printf '[xfce4-refresh-guardian] THRESHOLD: SWAP=%d%% (limit %d%%)\n' \
  "$SWAP_PCT" "$SWAP_LIMIT"

if (( SWAP_PCT >= SWAP_LIMIT )); then
  if (( DO_RESTART )); then
    if command -v xfce4-refresh >/dev/null 2>&1; then
      printf '[xfce4-refresh-guardian] Triggering xfce4-refresh (early recycle)…\n'
      xfce4-refresh
    else
      printf '[xfce4-refresh-guardian] xfce4-refresh not found, nothing to do.\n'
    fi
  else
    printf '[xfce4-refresh-guardian] Would run xfce4-refresh (dry run).\n'
  fi
else
  printf '[xfce4-refresh-guardian] Below threshold, nothing to do.\n'
fi
#+END_SRC

* swap-guardian systemd units
#+BEGIN_SRC bash :tangle x230/.config/systemd/user/early-refresh.service :mkdirp yes
[Unit]
Description=Early refresh based on RAM/SWAP thresholds

[Service]
Type=oneshot
ExecStart=/usr/bin/env xfce4-refresh-guardian --restart
KillMode=process
#+END_SRC

#+BEGIN_SRC bash :tangle x230/.config/systemd/user/early-refresh.timer :mkdirp yes
[Unit]
Description=Run early-refresh guardian periodically

[Timer]
OnBootSec=30s
OnUnitActiveSec=30s
Unit=early-refresh.service

[Install]
WantedBy=default.target
#+END_SRC

Handy commands for “show me everything right now”:
#+BEGIN_EXAMPLE
# Timer status:
systemctl --user status early-refresh.timer

# Service status (last run):
systemctl --user status early-refresh.service

# See when it’s scheduled:
systemctl --user list-timers 'early-refresh*'

# And logs for the guardian:
journalctl --user -u early-refresh.service --since "1 hour ago"

# show the actual unit contents systemd is using
systemctl --user cat early-refresh.timer early-refresh.service

# run it immediately (without waiting for the timer)
systemctl --user start early-refresh.service

# watch logs live while you test
journalctl --user -fu early-refresh.service

# stop it completely
systemctl --user disable --now early-refresh.timer
#+END_EXAMPLE

** xfce-show-desktop – toggle show-desktop and ensure xfdesktop
#+BEGIN_SRC bash :tangle x230/.local/bin/xfce4-show-desktop :shebang "#!/usr/bin/env bash"
set -euo pipefail

log() {
  printf '[xfce-show-desktop] %s\n' "$*"
}

ensure_xfdesktop() {
  if ! pgrep -x xfdesktop >/dev/null 2>&1; then
    log "xfdesktop not running, starting…"
    if command -v host-wrap >/dev/null 2>&1; then
      nohup host-wrap xfdesktop >/dev/null 2>&1 &
    else
      nohup xfdesktop >/dev/null 2>&1 &
    fi
  fi
}

toggle_show_desktop() {
  if ! command -v wmctrl >/dev/null 2>&1; then
    log "wmctrl not found, cannot toggle show desktop"
    exit 1
  fi

  # _NET_SHOWING_DESKTOP: 0 = normal, 1 = show desktop
  local state
  state=$(xprop -root _NET_SHOWING_DESKTOP 2>/dev/null | awk '{print $3}' || echo 0)

  if [[ "$state" = "0" ]]; then
    log "Enabling show desktop"
    wmctrl -k on
  else
    log "Disabling show desktop"
    wmctrl -k off
  fi
}

ensure_xfdesktop
toggle_show_desktop
#+END_SRC

