think/.local/bin/xfce4-refresh-guardian
#!/usr/bin/env bash
# xfce4-refresh-guardian – early panel refresh on high swap + panel revive

# [[file:../../../services.org::*xfce4-refresh-guardian – early panel refresh on high swap + panel revive][xfce4-refresh-guardian – early panel refresh on high swap + panel revive:1]]
#!/usr/bin/env bash
# xfce4-refresh-guardian – early refresh trigger based on swap
# and “is the panel actually visible?”

set -euo pipefail

SWAP_LIMIT="${SWAP_LIMIT:-80}"

DO_RESTART=0
if [[ "${1:-}" == "--restart" || "${1:-}" == "-r" ]]; then
  DO_RESTART=1
fi

# --- helper: is the xfce4-panel actually alive (proc + window)? ---
panel_is_alive=0

if pgrep -x xfce4-panel >/dev/null 2>&1; then
  # We have a process – now check for a real panel window if wmctrl exists.
  if command -v wmctrl >/dev/null 2>&1; then
    if wmctrl -lx 2>/dev/null | grep -qi "xfce4-panel.Xfce4-panel"; then
      panel_is_alive=1
    else
      printf '[xfce4-refresh-guardian] xfce4-panel process found, but no panel window.\n'
    fi
  else
    # No wmctrl? fall back to trusting the process
    panel_is_alive=1
  fi
else
  printf '[xfce4-refresh-guardian] No xfce4-panel process.\n'
fi

# If the panel is missing (no process OR no window), healing is top priority.
if (( panel_is_alive == 0 )); then
  printf '[xfce4-refresh-guardian] xfce4-panel is NOT alive, attempting heal via xfce4-heal…\n'
  if command -v xfce4-heal >/dev/null 2>&1; then
    xfce4-heal
    # Give it a moment, then re-check both process + window.
    sleep 1

    panel_is_alive_after=0
    if pgrep -x xfce4-panel >/dev/null 2>&1; then
      if command -v wmctrl >/dev/null 2>&1; then
        if wmctrl -lx 2>/dev/null | grep -qi "xfce4-panel.Xfce4-panel"; then
          panel_is_alive_after=1
        fi
      else
        panel_is_alive_after=1
      fi
    fi

    if (( panel_is_alive_after == 1 )); then
      printf '[xfce4-refresh-guardian] Panel is now running (process + window detected).\n'
    else
      printf '[xfce4-refresh-guardian] Heal attempted, but panel still not detected.\n'
    fi
  else
    printf '[xfce4-refresh-guardian] xfce4-heal not found; cannot restore panel.\n'
  fi

  # Panel health is a higher priority than swap tuning – stop here.
  exit 0
fi

# --- at this point: panel_is_alive == 1, proceed with swap threshold logic ---

# Read swap from /proc/meminfo (KiB)
swap_total_kb=$(awk '/^SwapTotal:/ {print $2}' /proc/meminfo)
swap_free_kb=$(awk '/^SwapFree:/  {print $2}' /proc/meminfo)

if (( swap_total_kb == 0 )); then
  SWAP_PCT=0
else
  swap_used_kb=$((swap_total_kb - swap_free_kb))
  SWAP_PCT=$(( (swap_used_kb * 100 + swap_total_kb/2) / swap_total_kb ))
fi

printf '[xfce4-refresh-guardian] THRESHOLD: SWAP=%d%% (limit %d%%)\n' \
  "$SWAP_PCT" "$SWAP_LIMIT"

if (( SWAP_PCT >= SWAP_LIMIT )); then
  if (( DO_RESTART )); then
    if command -v xfce4-refresh >/dev/null 2>&1; then
      printf '[xfce4-refresh-guardian] Triggering xfce4-refresh (early recycle)…\n'
      xfce4-refresh
    else
      printf '[xfce4-refresh-guardian] xfce4-refresh not found, nothing to do.\n'
    fi
  else
    printf '[xfce4-refresh-guardian] Would run xfce4-refresh (dry run).\n'
  fi
else
  printf '[xfce4-refresh-guardian] Below threshold, nothing to do.\n'
fi
# xfce4-refresh-guardian – early panel refresh on high swap + panel revive:1 ends here
