x230/.local/bin/xfce4-show-desktop
#!/usr/bin/env bash
# xfce-show-desktop – toggle show-desktop and ensure xfdesktop

# [[file:../../../services.org::*xfce-show-desktop – toggle show-desktop and ensure xfdesktop][xfce-show-desktop – toggle show-desktop and ensure xfdesktop:1]]
set -euo pipefail

log() {
  printf '[xfce-show-desktop] %s\n' "$*"
}

ensure_xfdesktop() {
  if ! pgrep -x xfdesktop >/dev/null 2>&1; then
    log "xfdesktop not running, starting…"
    if command -v host-wrap >/dev/null 2>&1; then
      nohup host-wrap xfdesktop >/dev/null 2>&1 &
    else
      nohup xfdesktop >/dev/null 2>&1 &
    fi
  fi
}

toggle_show_desktop() {
  if ! command -v wmctrl >/dev/null 2>&1; then
    log "wmctrl not found, cannot toggle show desktop"
    exit 1
  fi

  # _NET_SHOWING_DESKTOP: 0 = normal, 1 = show desktop
  local state
  state=$(xprop -root _NET_SHOWING_DESKTOP 2>/dev/null | awk '{print $3}' || echo 0)

  if [[ "$state" = "0" ]]; then
    log "Enabling show desktop"
    wmctrl -k on
  else
    log "Disabling show desktop"
    wmctrl -k off
  fi
}

ensure_xfdesktop
toggle_show_desktop
# xfce-show-desktop – toggle show-desktop and ensure xfdesktop:1 ends here
