think/.local/bin/swap-heal
#!/usr/bin/env bash
# swap-heal – safe swap purge + desktop/Flatpak heal

# [[file:../../../services.org::*swap-heal – safe swap purge + desktop/Flatpak heal][swap-heal – safe swap purge + desktop/Flatpak heal:1]]
#!/usr/bin/env bash
set -euo pipefail

log() { printf '[swap-heal] %s\n' "$*"; }

# 1) Inspect RAM + swap
mem_available_kb=$(awk '/^MemAvailable:/ {print $2}' /proc/meminfo)
swap_total_kb=$(awk '/^SwapTotal:/     {print $2}' /proc/meminfo)
swap_free_kb=$(awk '/^SwapFree:/      {print $2}' /proc/meminfo)
swap_used_kb=$((swap_total_kb - swap_free_kb))

log "MemAvailable: ${mem_available_kb} KiB"
log "Swap used:    ${swap_used_kb} KiB"

if (( swap_total_kb == 0 )); then
  log "No swap configured, nothing to do."
  exit 0
fi

# Simple safety rule: need at least as much free RAM as swap in use
needed_kb=${swap_used_kb}

if (( mem_available_kb < needed_kb )) && [[ "${SWAP_HEAL_FORCE:-0}" != 1 ]]; then
  log "Not enough free RAM to safely clear swap (need ${needed_kb} KiB)."
  log "Set SWAP_HEAL_FORCE=1 if you really want to override this (risk of OOM)."
  exit 1
fi

if [[ "${SWAP_HEAL_FORCE:-0}" == 1 ]]; then
  log "SWAP_HEAL_FORCE=1 set, ignoring RAM safety check. This may OOM the system."
else
  log "Enough RAM available, proceeding with swap purge."
fi

# 2) Drop caches
log "Dropping caches (vm.drop_caches=3)…"
if ! sudo sh -c 'echo 3 > /proc/sys/vm/drop_caches'; then
  log "WARNING: could not write vm.drop_caches; continuing anyway."
fi

# 3) swapoff + zramswap restart + swapon
log "swapoff -a…"
sudo swapoff -a

log "Restarting zramswap.service if present…"
if ! sudo systemctl restart zramswap.service 2>/dev/null; then
  log "zramswap.service restart failed or unit not present; continuing."
fi

log "swapon -a…"
sudo swapon -a

# Make sure zram actually ends up as swap if it exists
if [ -e /dev/zram0 ]; then
  disksize=$(cat /sys/block/zram0/disksize 2>/dev/null || echo 0)
  if [ "$disksize" -gt 0 ] && ! grep -q '^/dev/zram0' /proc/swaps; then
    log "Enabling zram swap on /dev/zram0…"
    if ! sudo swapon /dev/zram0 2>/dev/null; then
      log "WARNING: swapon /dev/zram0 failed; zram still not active."
    fi
  else
    log "zram0 already active or no disksize set, skipping swapon."
  fi
else
  log "/dev/zram0 not present; nothing to enable."
fi

# 4) Heal XFCE desktop
if command -v xfce4-heal >/dev/null 2>&1; then
  log "Running xfce4-heal…"
  xfce4-heal
else
  log "xfce4-heal not found; skipping."
fi

# 5) Heal Flatpak bridge + fontcache
if command -v flatpak-desktop-bridge >/dev/null 2>&1; then
  log "Refreshing Flatpak desktop bridge…"
  flatpak-desktop-bridge
fi

if command -v flatpak-fontcache-refresh >/dev/null 2>&1; then
  log "Refreshing Flatpak font cache…"
  flatpak-fontcache-refresh
fi

log "swap-heal ritual complete."
# swap-heal – safe swap purge + desktop/Flatpak heal:1 ends here
