x230/.local/bin/xfce4-heal
#!/usr/bin/env bash
# xfce4-heal - restart XFCE settings + panel in a clean env

# [[file:../../../services.org::*xfce4-heal - restart XFCE settings + panel in a clean env][xfce4-heal - restart XFCE settings + panel in a clean env:1]]
set -euo pipefail

log() {
  printf '[xfce4-heal] %s\n' "$*"
}

# Panel log file (for stdout/stderr of xfce4-panel)
PANEL_LOG="${XDG_CACHE_HOME:-$HOME/.cache}/xfce4-panel-heal.log"
mkdir -p "$(dirname "$PANEL_LOG")"
log "xfce4-panel log: $PANEL_LOG"

# Capture session env we actually want to preserve
SESSION_PATH="${PATH:-/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin}"
SESSION_LANG="${LANG:-en_AU.UTF-8}"

SESSION_XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-/run/user/$(id -u)}"
SESSION_XDG_SESSION_TYPE="${XDG_SESSION_TYPE:-x11}"
SESSION_XDG_CURRENT_DESKTOP="${XDG_CURRENT_DESKTOP:-XFCE}"
SESSION_XDG_CONFIG_HOME="${XDG_CONFIG_HOME:-$HOME/.config}"
SESSION_XDG_DATA_DIRS="${XDG_DATA_DIRS:-/usr/local/share:/usr/share}"
SESSION_XDG_DATA_HOME="${XDG_DATA_HOME:-$HOME/.local/share}"

# Global menu / integration knobs
SESSION_GTK_MODULES="${GTK_MODULES:-appmenu-gtk-module}"
SESSION_UBUNTU_MENUPROXY="${UBUNTU_MENUPROXY:-1}"
SESSION_QT_QPA_PLATFORMTHEME="${QT_QPA_PLATFORMTHEME:-gtk2}"

# nocsd hook, force it for the panel if present
NO_CSD_LIB="/usr/lib/x86_64-linux-gnu/libgtk3-nocsd.so.0"
if [ ! -e "$NO_CSD_LIB" ]; then
  NO_CSD_LIB=""
fi

log "Using PATH=${SESSION_PATH}"
log "Using XDG_RUNTIME_DIR=${SESSION_XDG_RUNTIME_DIR}, XDG_SESSION_TYPE=${SESSION_XDG_SESSION_TYPE}, XDG_CURRENT_DESKTOP=${SESSION_XDG_CURRENT_DESKTOP}"
log "Using XDG_DATA_DIRS=${SESSION_XDG_DATA_DIRS}, XDG_DATA_HOME=${SESSION_XDG_DATA_HOME}"
log "Using GTK_MODULES=${SESSION_GTK_MODULES}, UBUNTU_MENUPROXY=${SESSION_UBUNTU_MENUPROXY}, QT_QPA_PLATFORMTHEME=${SESSION_QT_QPA_PLATFORMTHEME}"
log "Using LD_PRELOAD=${NO_CSD_LIB:-<empty>} for panel tree"

# Run the actual heal logic inside a minimal, clean environment.
# Note: we do NOT carry over GIO_EXTRA_MODULES or other Guix glue here.
env -i \
  HOME="${HOME}" \
  USER="${USER:-$LOGNAME}" \
  SHELL="${SHELL:-/bin/bash}" \
  TERM="${TERM:-xterm-256color}" \
  DISPLAY="${DISPLAY:-:0}" \
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}" \
  XDG_RUNTIME_DIR="${SESSION_XDG_RUNTIME_DIR}" \
  XDG_SESSION_TYPE="${SESSION_XDG_SESSION_TYPE}" \
  XDG_CURRENT_DESKTOP="${SESSION_XDG_CURRENT_DESKTOP}" \
  XDG_CONFIG_HOME="${SESSION_XDG_CONFIG_HOME}" \
  XDG_DATA_DIRS="${SESSION_XDG_DATA_DIRS}" \
  XDG_DATA_HOME="${SESSION_XDG_DATA_HOME}" \
  LANG="${SESSION_LANG}" \
  PATH="${SESSION_PATH}" \
  GTK_MODULES="${SESSION_GTK_MODULES}" \
  UBUNTU_MENUPROXY="${SESSION_UBUNTU_MENUPROXY}" \
  QT_QPA_PLATFORMTHEME="${SESSION_QT_QPA_PLATFORMTHEME}" \
  GTK_CSD=0 \
  LD_PRELOAD="${NO_CSD_LIB}" \
  PANEL_LOG="${PANEL_LOG}" \
  bash -c '
    set -euo pipefail

    log_inner() {
      printf "[xfce4-heal] %s\n" "$*"
    }

    panel_log="${PANEL_LOG:-/dev/null}"

    if command -v xfce-appmenu-configure >/dev/null 2>&1; then
      log_inner "Ensuring XFCE appmenu xsettings and registrar..."
      xfce-appmenu-configure >/dev/null 2>&1 || log_inner "xfce-appmenu-configure failed; continuing."
    elif [ -x /usr/libexec/vala-panel/appmenu-registrar ] && ! gdbus call --session --dest com.canonical.AppMenu.Registrar --object-path /com/canonical/AppMenu/Registrar --method org.freedesktop.DBus.Peer.Ping >/dev/null 2>&1; then
      pkill -x appmenu-registrar >/dev/null 2>&1 || true
      log_inner "Starting appmenu-registrar..."
      nohup /usr/libexec/vala-panel/appmenu-registrar -r >/dev/null 2>&1 &
    fi

    # Kill stale daemons if they exist
    for name in xfce4-panel xfsettingsd; do
      if pgrep -x "$name" >/dev/null 2>&1; then
        log_inner "Killing $name…"
        pkill -x "$name" || true
      fi
    done

    # Wait briefly for them to die
    for name in xfce4-panel xfsettingsd; do
      for i in 1 2 3 4 5; do
        if ! pgrep -x "$name" >/dev/null 2>&1; then
          break
        fi
        sleep 0.2
      done
    done

    # Start settings daemon
    if command -v xfsettingsd >/dev/null 2>&1; then
      log_inner "Starting xfsettingsd…"
      nohup xfsettingsd >/dev/null 2>&1 &
    else
      log_inner "xfsettingsd not found in PATH."
    fi

    # Start panel, logging output
    if command -v xfce4-panel >/dev/null 2>&1; then
      log_inner "Starting xfce4-panel (logging to ${panel_log})…"
      nohup xfce4-panel >>"${panel_log}" 2>&1 &
    else
      log_inner "xfce4-panel not found in PATH."
    fi
  '
# xfce4-heal - restart XFCE settings + panel in a clean env:1 ends here
